
def task_6_4():
    """
    1) 6.4. (условный оператор использовать можно) Дана последовательность из n вещественных чисел, начинающаяся с отрица-
    тельного числа. Определить, какое количество отрицательных чисел записано в начале последовательности.
    Условный оператор не использовать.

    :return: None
    """

    return None


def task_6_6_b():
    """
    2) 6.6. (б + разность от большего к меньшему, без использования дополнительных функций) Дана последовательность
    вещественных чисел a1, a2, ..., a15, упорядоченная по возрастанию, и число n, не равное ни одному из чисел
    последовательности и такое, что a1 < n < a15. б) Найти два элемента последовательности (их порядковые номера и
    значение) в интервале, между которыми находится значение n.

    :return: None
    """

    return None


def task_6_42_a():
    """
    3) 6.42.(а). Дано натуральное число, в котором все цифры различны. Определить: а) порядковые номера двух его
    максимальных цифр, считая номера: от конца числа; от начала числа;

    :return: None
    """

    return None
